5ime/ESP32CamPlus/app_httpd.cpp
static void flash_burst(uint8_t level, uint16_t interval_ms, uint8_t repeat) {
    if (repeat == 0 || interval_ms == 0) {
        return;
    }
    const uint8_t previous = app_get_flash_duty();
    for (uint8_t i = 0; i < repeat; ++i) {
        app_set_flash_duty(level);
        vTaskDelay(interval_ms / portTICK_PERIOD_MS);
        app_set_flash_duty(0);
        if (i + 1 < repeat) {
            vTaskDelay(interval_ms / portTICK_PERIOD_MS);
        }
    }
    app_set_flash_duty(previous);
}

static esp_err_t flash_handler(httpd_req_t *req) {
    char query[FLASH_QUERY_BUF_SIZE];
    bool enable = false;
    bool enable_defined = false;
    uint8_t pulse_count = 0;
    uint16_t pulse_interval = 0;
    int target_level = -1;
    
    // Lambda函数：数值范围限制
    auto clamp = [](int value, int min_value, int max_value) {
        return std::max(min_value, std::min(value, max_value));
    };
    
    // Lambda函数：解析布尔值
    auto parse_bool = [](const char *text) {
        return (strcmp(text, "1") == 0) || 
               (strcasecmp(text, "true") == 0) || 
               (strcasecmp(text, "on") == 0);
    };

    // 解析URL查询参数
    if (httpd_req_get_url_query_str(req, query, sizeof(query)) == ESP_OK) {
        char param[16];
        
        // 解析 enable 参数
        if (httpd_query_key_value(query, "enable", param, sizeof(param)) == ESP_OK) {
            enable = parse_bool(param);
            enable_defined = true;
        }
        
        // 解析 level 参数
        if (httpd_query_key_value(query, "level", param, sizeof(param)) == ESP_OK) {
            target_level = clamp(atoi(param), FLASH_MIN_LEVEL, FLASH_MAX_LEVEL);
        }
        
        // 解析 interval 参数
        if (httpd_query_key_value(query, "interval", param, sizeof(param)) == ESP_OK) {
            pulse_interval = static_cast<uint16_t>(
                clamp(atoi(param), FLASH_MIN_INTERVAL_MS, FLASH_MAX_INTERVAL_MS));
        }
        
        // 解析 count 参数
        if (httpd_query_key_value(query, "count", param, sizeof(param)) == ESP_OK) {
            pulse_count = static_cast<uint8_t>(
                clamp(atoi(param), FLASH_MIN_COUNT, FLASH_MAX_COUNT));
        }
    }

    // 验证必需参数
    if (!enable_defined) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "请提供 enable=0/1");
        return ESP_FAIL;
    }

    // 执行闪光灯控制逻辑
    if (!enable) {
        // 关闭闪光灯
        app_set_flash_duty(0);
        pulse_count = 0;
    } else if (pulse_count == 0 || pulse_interval == 0) {
        // 常亮模式
        if (target_level < 0) {
            target_level = app_get_flash_duty();
        }
        app_set_flash_duty(static_cast<uint8_t>(target_level));
    } else {
        // 闪烁模式
        if (target_level < 0) {
            target_level = FLASH_MAX_LEVEL;
        }
        flash_burst(static_cast<uint8_t>(target_level), pulse_interval, pulse_count);
    }

    // 返回JSON响应
    char resp[FLASH_RESP_BUF_SIZE];
    snprintf(resp, sizeof(resp), 
             "{\"enable\":%u,\"level\":%u,\"interval\":%u,\"count\":%u}",
             enable ? 1 : 0,
             app_get_flash_duty(),
             pulse_interval,
             pulse_count);
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_sendstr(req, resp);
    
    log_i("Flash: enable=%u level=%u interval=%u count=%u",
          enable ? 1 : 0,
          app_get_flash_duty(),
          pulse_interval,
          pulse_count);
    return ESP_OK;
}

// ==== 云服务器上传 HTTP 接口 ====
static esp_err_t cloud_upload_handler(httpd_req_t *req) {
    bool success = false;
    
    log_i("Cloud upload request received");
    
    // 调用上传函数（会自动获取新的帧）
    success = app_upload_to_cloud();
    
    // 返回JSON响应
    char resp[128];
    snprintf(resp, sizeof(resp), 
             "{\"success\":%s,\"upload_count\":%lu,\"fail_count\":%lu}",
             success ? "true" : "false",
             app_get_upload_count(),
             app_get_upload_fail_count());
    
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_sendstr(req, resp);
    
    log_i("Cloud upload completed: %s", success ? "success" : "failed");
    return ESP_OK;
}

// ==== 云上传状态查询接口 ====
static esp_err_t cloud_status_handler(httpd_req_t *req) {
    char resp[128];
    snprintf(resp, sizeof(resp), 
             "{\"upload_count\":%lu,\"fail_count\":%lu,\"total\":%lu}",
             app_get_upload_count(),
             app_get_upload_fail_count(),
             app_get_upload_count() + app_get_upload_fail_count());
    
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_sendstr(req, resp);
    return ESP_OK;
}

void startCameraServer() {
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.max_uri_handlers = 16;

    // 定义URI处理器
    httpd_uri_t index_uri = {"/", HTTP_GET, index_handler, NULL};
    httpd_uri_t status_uri = {"/status", HTTP_GET, status_handler, NULL};
    httpd_uri_t cmd_uri = {"/control", HTTP_GET, cmd_handler, NULL};
    httpd_uri_t capture_uri = {"/capture", HTTP_GET, capture_handler, NULL};
    httpd_uri_t stream_uri = {"/stream", HTTP_GET, stream_handler, NULL};
    httpd_uri_t bmp_uri = {"/bmp", HTTP_GET, bmp_handler, NULL};
    httpd_uri_t xclk_uri = {"/xclk", HTTP_GET, xclk_handler, NULL};
    httpd_uri_t reg_uri = {"/reg", HTTP_GET, reg_handler, NULL};
    httpd_uri_t greg_uri = {"/greg", HTTP_GET, greg_handler, NULL};
    httpd_uri_t pll_uri = {"/pll", HTTP_GET, pll_handler, NULL};
    httpd_uri_t win_uri = {"/resolution", HTTP_GET, win_handler, NULL};
    httpd_uri_t flash_uri = {"/flash", HTTP_GET, flash_handler, NULL};
    httpd_uri_t cloud_upload_uri = {"/cloud/upload", HTTP_GET, cloud_upload_handler, NULL};
    httpd_uri_t cloud_status_uri = {"/cloud/status", HTTP_GET, cloud_status_handler, NULL};

    // 初始化帧率过滤器
    ra_filter_init(&ra_filter, 20);

#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
    // 初始化人脸识别器
    recognizer.set_partition(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY, "fr");
    recognizer.set_ids_from_flash();
#endif

